In [2]:
import numpy as np
import pandas as pd

Pandas Series

In [3]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [4]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [5]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [6]:
d ={0:'numpy',1:'pandas',2:'scikit',4:'tensorflow'}

In [7]:
dictser3 = pd.Series(d)

In [8]:
dictser3

0         numpy
1        pandas
2        scikit
4    tensorflow
dtype: object

In [9]:
dictser3[0]

'numpy'

In [10]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

Pandas Dataframes

In [11]:
dat = np.random.randn(5,4)

In [12]:
df = pd.DataFrame(dat,['A','B','C','D','E'],['W','X','Y','Z'])

In [13]:
df

          W         X         Y         Z
A -0.273508  0.092180  0.454349 -0.742409
B  1.248581 -0.486243 -1.537499 -0.341396
C -2.073485  1.261798  1.505384 -1.215862
D  0.830577  0.213866  1.244264  1.566043
E  0.723804  0.664922 -0.483627 -0.037227

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
type(df['W'])

pandas.core.series.Series

In [16]:
df['W']

A   -0.273508
B    1.248581
C   -2.073485
D    0.830577
E    0.723804
Name: W, dtype: float64

In [17]:
df[['W','Z']]

          W         Z
A -0.273508 -0.742409
B  1.248581 -0.341396
C -2.073485 -1.215862
D  0.830577  1.566043
E  0.723804 -0.037227

In [18]:
df['new'] = df['W'] + df['Z']

In [19]:
df

          W         X         Y         Z       new
A -0.273508  0.092180  0.454349 -0.742409 -1.015917
B  1.248581 -0.486243 -1.537499 -0.341396  0.907185
C -2.073485  1.261798  1.505384 -1.215862 -3.289347
D  0.830577  0.213866  1.244264  1.566043  2.396621
E  0.723804  0.664922 -0.483627 -0.037227  0.686577

In [20]:
df.drop('new',1,inplace=True)

In [21]:
df

          W         X         Y         Z
A -0.273508  0.092180  0.454349 -0.742409
B  1.248581 -0.486243 -1.537499 -0.341396
C -2.073485  1.261798  1.505384 -1.215862
D  0.830577  0.213866  1.244264  1.566043
E  0.723804  0.664922 -0.483627 -0.037227

In [22]:
type(df.loc['A','W'])

numpy.float64

In [23]:
df.loc[['A','B']]

          W         X         Y         Z
A -0.273508  0.092180  0.454349 -0.742409
B  1.248581 -0.486243 -1.537499 -0.341396

In [24]:
df.iloc[:]

          W         X         Y         Z
A -0.273508  0.092180  0.454349 -0.742409
B  1.248581 -0.486243 -1.537499 -0.341396
C -2.073485  1.261798  1.505384 -1.215862
D  0.830577  0.213866  1.244264  1.566043
E  0.723804  0.664922 -0.483627 -0.037227

In [25]:
booldf = df > 0

In [26]:
booldf

       W      X      Y      Z
A  False   True   True  False
B   True  False  False  False
C  False   True   True  False
D   True   True   True   True
E   True   True  False  False

In [27]:
df[df > 0]

          W         X         Y         Z
A       NaN  0.092180  0.454349       NaN
B  1.248581       NaN       NaN       NaN
C       NaN  1.261798  1.505384       NaN
D  0.830577  0.213866  1.244264  1.566043
E  0.723804  0.664922       NaN       NaN

In [28]:
df[(df['W']>0) & (df['Y']>0.3)]

          W         X         Y         Z
D  0.830577  0.213866  1.244264  1.566043

In [29]:
df[(df['W']>0) | (df['Y']>0.3)]

          W         X         Y         Z
A -0.273508  0.092180  0.454349 -0.742409
B  1.248581 -0.486243 -1.537499 -0.341396
C -2.073485  1.261798  1.505384 -1.215862
D  0.830577  0.213866  1.244264  1.566043
E  0.723804  0.664922 -0.483627 -0.037227

In [38]:
df.reset_index(inplace=True)

In [33]:
states = 'CA IL MO CO NC'.split()

In [34]:
df['States'] = states

In [39]:
df

  index         W         X         Y         Z States
0     A -0.273508  0.092180  0.454349 -0.742409     CA
1     B  1.248581 -0.486243 -1.537499 -0.341396     IL
2     C -2.073485  1.261798  1.505384 -1.215862     MO
3     D  0.830577  0.213866  1.244264  1.566043     CO
4     E  0.723804  0.664922 -0.483627 -0.037227     NC

In [41]:
df.set_index('States',inplace=True)

In [42]:
df

       index         W         X         Y         Z
States
CA         A -0.273508  0.092180  0.454349 -0.742409
IL         B  1.248581 -0.486243 -1.537499 -0.341396
MO         C -2.073485  1.261798  1.505384 -1.215862
CO         D  0.830577  0.213866  1.244264  1.566043
NC         E  0.723804  0.664922 -0.483627 -0.037227

In [43]:
df.drop('index',1,inplace=True)

In [44]:
df

               W         X         Y         Z
States
CA     -0.273508  0.092180  0.454349 -0.742409
IL      1.248581 -0.486243 -1.537499 -0.341396
MO     -2.073485  1.261798  1.505384 -1.215862
CO      0.830577  0.213866  1.244264  1.566043
NC      0.723804  0.664922 -0.483627 -0.037227